#pragma once


/**********************************************************************************/
/**структура содржащая квадратную матрицу и целочисленный признак достоверности****/
/**********************************************************************************/
struct matrix_correct{
    int correct;
    double **mas;
};

/**********************************************************************************/
/**структура содржащая double и целочисленный признак достоверности****************/
/**********************************************************************************/
struct double_correct{
    int correct;
    double data;

};


